Revit 2026 API

# SelectionGetReferences Method

---

Returns the references that are currently selected.

**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Reference> GetReferences()
```
```vb
Public Function GetReferences As IList(Of Reference)
```
```cpp
public:
IList<Reference^>^ GetReferences()
```
```fsharp
member GetReferences : unit -> IList<Reference>
```

#### Return Value

IListReference The collection containing the selected references.

The references can be an element or subelement in the host or a linked document.

#### Reference

Selection Class

Autodesk.Revit.UI.Selection Namespace